{
  "states": [
    {
      "label": "s1",
      "msg": "Greetings, stranger. You look like you have travelled a great distance to get here.",
      "initial": true,
      "transitions": [
        {
          "trigger": "Hold on there... this is a cyberpunk game, not a fantasy game. You should've called me 'chummer' or something.",
          "next_state": "s2"
        },
        {
          "trigger": "Hi there. Who are you?",
          "next_state": "s3"
        }
      ]
    },
    {
      "label": "s2",
      "msg": "Fair enough. Yolo, chummer. I can see you've been hacking the intertubes for gigaparsecs.",
      "transitions": [
        {
          "trigger": "Much better, thank you. Now can you explain what all of this is about?",
          "next_state": "s4"
        }
      ]
    },
    {
      "label": "s3",
      "msg": "I am a mysterious stranger... I could be anyone, or anything, you want me to be. The only limit is your imagination.",
      "transitions": [
        {
          "trigger": "Sounds like you are the beginnings of a generic NPC class, designed to be flexible yet powerful.",
          "next_state": "s5"
        },
        {
          "trigger": "Can you be a dog?",
          "next_state": "s6"
        }
      ]
    },
    {
      "label": "s4",
      "msg": "This is a tech demo using the pyved-engine",
      "terminal": true
    },
    {
      "label": "s5",
      "msg": "Actually I'm just a generic isometric map object right now. But yeah, that is pretty flexible and powerful.",
      "transitions": [
        {
          "trigger": "Just like a monomolecular sword!",
          "next_state": "s7"
        },
        {
          "trigger": "Well, it was nice talking to you. I'll see you around.",
          "next_state": "s8"
        }
      ]
    },
    {
      "label": "s6",
      "msg": "I could be a dog, a character, a computer terminal. Anything you need for the game.",
      "transitions": [
        {
          "trigger": "Be a dog right now.",
          "next_state": "s9"
        },
        {
          "trigger": "That sounds really useful.",
          "next_state": "s10"
        }
      ]
    },
    {
      "label": "s7",
      "msg": "That's the spirit. Keep that in mind until the inventory system and combat get worked out.",
      "terminal": true
    },
    {
      "label": "s8",
      "msg": "Of course you will. I'm the only entity besides you on this map.",
      "terminal": true
    },
    {
      "label": "s9",
      "msg": "[You stand before a friendly-looking Samoyed dog. For some reason, it is wearing a wizard robe and has glowing eyes.]",
      "transitions": [
        {
          "trigger": "[Pet the dog]",
          "next_state": "s11"
        }
      ]
    },
    {
      "label": "s10",
      "msg": "Well, that's the point. This code is just a starting point; bricks from which games can be created.",
      "terminal": true
    },
    {
      "label": "s11",
      "msg": "Achievement unlocked: It is possible to pet the dog in this tech demo!",
      "terminal": true
    }
  ]
}
